[{"Name":"Greek Lemon Chicken and Potatoes","Summary":"I don't have the energy or courage to cater for a living but, if I did, this Greek lemon chicken and potatoes would be one of my go-to entrees, and not just for big, fat weddings. It's a proven crowd-pleaser, simple to make, and easy on the wallet.","PreparationTime":40,"Size":1},
    {"Name":"Roast Sticky Chicken-Rotisserie Style","Summary":"Ever wish you could get that restaurant-style rotisserie chicken at home? Well, with minimal preparation and about 5 hours' cooking time (great for the weekends!) you can! I don't bother to baste the bird, though some like to for the first hour. The pan juices always caramelize at the bottom, and the chicken will turn golden brown...fall-off-the-bone good!","PreparationTime":70,"Size":3},
    {"Name":"Angela's Awesome Enchiladas","Summary":"The secret is in the seasonings! I whipped these up on my own using stuff I had on hand. Shredding the chicken is the most time-consuming step, but it's worth it in the end. Give these babies a try! Serve with sour cream and a side of Spanish rice.","PreparationTime":90,"Size":1},
    {"Name":"Chicken Milano","Summary":"A delicious pasta and chicken dish with garlic, sun-dried tomatoes and fresh basil. Use the dry packaged sun-dried tomatoes instead of the tomatoes packed in olive oil. The sauce can be kept, covered, for one day in the refrigerator; heat again over low heat. Try it with some crusty bread if desired.","PreparationTime":30,"Size":1},
    {"Name":"Pork Picadillo","Summary":"This minced pork dish from the Philippines with a rainbow assortment of bell peppers is easy to prepare and yet very tasty.","PreparationTime":35,"Size":1},
    {"Name":"Sweet and Sour Pork III","Summary":"My husband's grandmother was Chinese. She taught me this one. This is the way Gramma made Sweet and Sour all her life (she died 6 years ago at age 94). The secret is apple cider vinegar.","PreparationTime":60,"Size":1},
    {"Name":"Wine-Braised Beef Brisket","Summary":"This is yummy the day you make it, but is even more delicious the next day.","PreparationTime":150,"Size":1},
    {"Name":"Beef Tips and Noodles","Summary":"This is a great dish that's very easy to make with just a few ingredients. Great with rolls of any type. I got this recipe from my mom years ago and it is a family favorite.","PreparationTime":75,"Size":1},
    {"Name":"Tomato-Rich Fish Stew","Summary":"The lycopene in tomatoes protects our brains against age-related decline. Fish's good fat has the same effect.","PreparationTime":40,"Size":1},
    {"Name":"Cathy's Amazing Fish Chowder","Summary":"Restaurant style comfort food directly from Maine that is easy to make and wonderful to eat!! Any white fish such as haddock may be used in place of the cod. Serve with crackers and corn bread if desired!! The real person that deserves full credit for this recipe is a wonderful mother named Cathy that lives in Chicago and loves her son in Kansas!","PreparationTime":60,"Size":1},
    {"Name":"Citrus Baked Fish","Summary":"Salmon works best in this citrus-flavored dish.","PreparationTime":25,"Size":1},
    {"Name":"Firecracker Grilled Alaska Salmon","Summary":"These are salmon fillets in a tasty, tangy sauce with a little heat! Serve with rice and a simple stir-fry of baby corn, shiitake mushrooms and snow peas.","PreparationTime":120,"Size":1},
    {"Name":"Ham and Split Pea Soup","Summary":"With the slightly sweet, somewhat salty, and subtly smoky flavor of the ham, this hearty soup is the ideal fall or winter soup -- a great one for lunches, or as a starter for dinner.","PreparationTime":110,"Size":1},
    {"Name":"French Onion Soup Gratinee","Summary":"About as good as it gets! This is the version of French Onion Soup that people seek when they go to restaurants. I have been making it for 30 years and it never fails to please. It makes an exquisite presentation, too!","PreparationTime":75,"Size":1},
    {"Name":"Tomato Bisque with Chicken","Summary":"Yummy and filling tomato bisque with tender pieces of chicken! Use a store-cooked chicken and a can of tomatoes, and this dinner will be ready before you know it! Definitely one of my 30-minute meals.","PreparationTime":35,"Size":1},
    {"Name":"Vegetable Beef Soup","Summary":"This is a great winter warmer and the meat turns out so tender that it practically melts in your mouth!","PreparationTime":180,"Size":1},
    {"Name":"Greek Salad","Summary":"An authentic Greek salad from Oia, Santorini in Greece. Traveling through Greece, I feel in love with the Greek salads on the islands because they had no lettuce. When I came home, I was determined to replicate that salad for family and friends. This is a great green salad recipe because extra salad can marinate in the dressing overnight and be eaten the next day in pita pockets as a sandwich.","PreparationTime":30,"Size":1},
    {"Name":"Russian Salad","Summary":"This is a recipe my mom and grandmother use every time there's a family gathering or a special occasion. To make this a vegetarian dish just leave out the ham. Potatoes, carrots, and eggs do not have to be chilled completely after boiling. Dill can be substituted for parsley if desired.","PreparationTime":50,"Size":1},
    {"Name":"Caprese ","Summary":"Because this salad is so simple, fresh, top-quality tomatoes and mozzarella are important.","PreparationTime":15,"Size":1},
    {"Name":"Mediterranean Bean Salad","Summary":"A refreshing blend of flavors great for summer or simple dinners! Flavors tend to blend better after time.","PreparationTime":15,"Size":1},
    {"Name":"Creme Caramel","Summary":"Creme caramel belongs on the short list for 'World's Greatest Dessert.' The way the almost-burnt caramel layer gets fused on, and becomes one with, the creamy custard is nothing short of magic.","PreparationTime":95,"Size":1},
    {"Name":"Chocolate Souffle","Summary":"These visually impressive individual chocolate soufflés are perfect for your special someone. If you're serving more people, the recipe should scale up just fine.","PreparationTime":40,"Size":1}]